purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
/*
 * Copyright 2010-2016 Amazon.com, Inc. or its affiliates. All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License").
 * You may not use this file except in compliance with the License.
 * A copy of the License is located at
 *
 *  http://aws.amazon.com/apache2.0
 *
 * or in the "license" file accompanying this file. This file is distributed
 * on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either
 * express or implied. See the License for the specific language governing
 * permissions and limitations under the License.
 */
#include <string.h>
//#include <list.h>
/*
#include <stdio.h>
#include <stdlib.h>
#include <errno.h>
#ifndef MSOCK_H
#define MSOCK_H

// this is for windows compat
#define SOCKET int

#ifdef __MINGW32__ 
#undef SOCKET
#undef socklen_t 
#define WINVER 0x0501 
#include <ws2tcpip.h> 
#define EWOULDBLOCK WSAEWOULDBLOCK
#define close closesocket
#define socklen_t int
typedef unsigned int in_addr_t;
#else
//#include <sys/socket.h>
//#include <netinet/in.h>
//#include <sys/un.h>
//#include <netinet/tcp.h>
//#include <arpa/inet.h>
#include <netdb.h>
#endif
#ifndef IPV6_ADD_MEMBERSHIP
#define IPV6_ADD_MEMBERSHIP IPV6_JOIN_GROUP
#endif
*/

#include <ti/sysbios/knl/Task.h>
#include "aws_iot_log.h"
#include "aws_iot_version.h"
#include "aws_iot_mqtt_client_interface.h"
#include "aws_iot_config.h"


#include "pin_mux_config.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_gpio.h"
#include "pin.h"
#include "gpio.h"
#include "prcm.h"
#include "rom.h"
#include "rom_map.h"


#include "wificonfig.h"

//------from adc example--------///
// Standard includes
//#include <string.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>

// Driverlib includes
#include "utils.h"
//#include "hw_memmap.h"
#include "hw_common_reg.h"
//#include "hw_types.h"
#include "hw_adc.h"
#include "hw_ints.h"
#include "hw_gprcm.h"
//#include "rom.h"
//#include "rom_map.h"
#include "interrupt.h"
#include "prcm.h"
#include "uart.h"
//#include "pinmux.h"
#include "pin.h"
#include "adc.h"

//#include "adc_userinput.h"
//#include "common/uart_if.h"
//#include "common/common.h"
/////-------------/////
#include "common/udma_if.h"
//#include "common/common.h"
#ifndef NOTERM
#include "common/uart_if.h"
#include "common/uart_if.c"
#endif

// custom headers and defines for udp socket..

//  From SNTP

#include <time.h>

#include <xdc/std.h>
#include <xdc/runtime/System.h>

#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/hal/Seconds.h>
#include <ti/net/sntp/sntp.h>

#include <simplelink.h>
#include <socket.h>

////--------added for http-------///////

#include "jsmn.h"
char deviceID[9] = "DXTRPIE1";
char philips_id[32] = "3351225515126c7313ee321303497f3";
char philipsgetdata[1500];
int id_len;
int philips_config=0;
int philipsconfigstatus=0;
int devicestate=1;
char philips_uri[15];
char belkin_uri[10][15];
char HOST_NAME[15];
char PUT_DATA[52];
char philips_request_uri[100];
int HOST_PORT=0;

int enddevicestatus=0;//when new ip of philips or belkin discovered it is high to send mqtt message of all ips
int philipsidstatus=0;//if it is 0 that is there is no philips user id. if it is 1 means we have to press link button. if it is 2 we have philips user id
int philipsipstatus=0;//
int belkinipstatus=0;//
int philipsget=0;//we have to make it high to decode the json format for philips get in parse json.
int philipsbulbget=0;//it is high when individual bulb is controlled and to decode the 1st key in json decode to get the status of that bulb.
int philipssinglebulbget=0;//it is high in the json pase decode after get the 1st key. if it is high mqtt message will send to philipsbulbdetais topic.
char bulbnumber[2];//it is used to store the philips bulb id when it is controlled. 
char belkinstatus[10][2];//it is the on off status of the belkins
//belkinstatus[9]={0,0,0};

//////--------hardcoded philips user id----------///////////
//strcpy(philips_id,"3351225515126c7313ee321303497f3");
////////////////


// HTTP Client lib
//#include </home/mdubuntu/ti/tirex-content/CC3200SDK_1.1.0/cc3200-sdk/netapps/http/client/httpcli.h>
//#include </home/mdubuntu/ti/tirex-content/CC3200SDK_1.1.0/cc3200-sdk/netapps/http/client/common.h>

#include <ti/net/http/httpcli.h>
#include <ti/net/http/httpcli.c>
#include <ti/net/http/httpstd.c>
//#include</home/mdubuntu/ti/tirex-content/CC3200SDK_1.1.0/cc3200-sdk/netapps/http/client/httpcli.h>
// For SimpleLink, *********  include sssl.h add ~/ti/<tirtos_cc32xx_x_xx_xx_xx>/products/ns_1_11_00_10/packages/ti/net/http/
#include <ti/net/http/sssl.h>
//#define PUT_REQUEST_URI 	"/api/3351225515126c7313ee321303497f3/lights/1/state"
//#define PUT_DATA            "{\"on\":false}"
#define PUT_DATA1            "{\"on\":true}"
#define PUT_DATA2            "{\"on\":false}"

#define POST_REQUEST_URI 	"/upnp/control/basicevent1"
//#define POST_DATA           "{\n\"name\":\"xyz\",\n\"address\":\n{\n\"plot#\":12,\n\"street\":\"abc\",\n\"city\":\"ijk\"\n},\n\"age\":30\n}"
#define POST_DATA "<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body><u:SetBinaryState xmlns:u=\"urn:Belkin:service:basicevent:1\"><BinaryState>0</BinaryState></u:SetBinaryState></s:Body></s:Envelope>"

#define POST_DATA1 "<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body><u:SetBinaryState xmlns:u=\"urn:Belkin:service:basicevent:1\"><BinaryState>1</BinaryState></u:SetBinaryState></s:Body></s:Envelope>"


//#define GET_REQUEST_URI 	"/api/3351225515126c7313ee321303497f3/lights"

#define CONFIG_URI              "/api"
#define CONFIG_DATA		"{\"devicetype\":\"my_hue_app#iphone peter\"}"

//#define sdata  "{\"on\":true}"
//#define HOST_NAME       	"192.168.0.115" //"<host name>"for philips
//#define HOST_PORT 80 //for philips

//#define HOST_NAME       	"192.168.0.108" //"<host name>"fpr belkin
//#define HOST_PORT           49153  //for belkin

#define READ_SIZE           1450
#define MAX_BUFF_SIZE       1460

// from udp//
#define IP_ADDR            0xEFFFFFFA   /* 239.255.255.250 unsigned int ip= 4026531834; */
#define PORT_NUM           1900
#define BUF_SIZE           1400
#define UDP_PACKET_COUNT   10    // default 1000

