purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
#define REV_IP(X) ((X << 24) | (( X & 0xff00 ) << 8) | (( X >> 8) & 0xff00 ) | ( X >> 24 ))

#define HELLO_PORT 1900
#define HELLO_GROUP "239.255.255.250"
#define MSGBUFSIZE 576



/////------from udp-----///////// 
//int BsdUdpClient(unsigned short usPort);
//int BsdUdpServer(unsigned short usPort);
static void InitializeAppVariables();
//////-------------///////////

// Application specific status/error codes
typedef enum{
 /* Choosing this number to avoid overlap with host-driver's error codes */
    SOCKET_CREATE_ERROR = -0x7D0,
    BIND_ERROR = SOCKET_CREATE_ERROR - 1,
    SEND_ERROR = BIND_ERROR - 1,
    RECV_ERROR = SEND_ERROR -1,
    SOCKET_CLOSE = RECV_ERROR -1,
/*  Normal */

    DEVICE_NOT_IN_STATION_MODE = -0x7D0,       
    DEVICE_START_FAILED = DEVICE_NOT_IN_STATION_MODE - 1,
    INVALID_HEX_STRING = DEVICE_START_FAILED - 1,
    TCP_RECV_ERROR = INVALID_HEX_STRING - 1,
    TCP_SEND_ERROR = TCP_RECV_ERROR - 1,
    FILE_NOT_FOUND_ERROR = TCP_SEND_ERROR - 1,
    INVALID_SERVER_RESPONSE = FILE_NOT_FOUND_ERROR - 1,
    FORMAT_NOT_SUPPORTED = INVALID_SERVER_RESPONSE - 1,
    FILE_OPEN_FAILED = FORMAT_NOT_SUPPORTED - 1,
    FILE_WRITE_ERROR = FILE_OPEN_FAILED - 1,
    INVALID_FILE = FILE_WRITE_ERROR - 1,
    SERVER_CONNECTION_FAILED = INVALID_FILE - 1,
    GET_HOST_IP_FAILED = SERVER_CONNECTION_FAILED  - 1,
    
    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile unsigned long  g_ulStatus = 0;//SimpleLink Status
unsigned long  g_ulDestinationIP;
unsigned long  g_ulDestinationIp; // IP address of destination server
unsigned long  g_ulGatewayIP = 0; //Network Gateway IP address
//unsigned char  g_ucConnectionSSID[SSID_LEN_MAX+1]; //Connection SSID
//unsigned char  g_ucConnectionBSSID[BSSID_LEN_MAX]; //Connection BSSID
unsigned char g_buff[MAX_BUFF_SIZE+1];
long bytesReceived = 0; // variable to store the file size
//From UDP//
unsigned int   g_uiPortNum = PORT_NUM;
volatile unsigned long  g_ulPacketCount = UDP_PACKET_COUNT;
unsigned char  g_ucSimplelinkstarted = 0;
unsigned long  g_ulIpAddr = 0;
char g_cBsdBuf[BUF_SIZE];

#if defined(ccs) || defined(gcc)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif  
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************


int UDPRECIEVER();
///////////-----from wifi audio app------------////////////

#define INVALID_CLIENT_ADDRESS            0x00000000 //Invalid clientIP 
//*****************************************************************************
//
// MultiCast Group IP Address (Any IP in Range 224.0.0.0 - 239.255.255.255)
//
//*****************************************************************************
#define ADDR_MULTICAST_GROUP 	   0xE00000FB   //"224.0.0.251" //Using mDNS IP
  
//*****************************************************************************
//
// UDP Socket Port
//
//*****************************************************************************
#define AUDIO_PORT                     (1900)  
//*****************************************************************************
//
// Define Packet Size, Rx and Tx Buffer
//
//*****************************************************************************  
#define PACKET_SIZE             1024
#define PLAY_WATERMARK			30*1024
#define RECORD_BUFFER_SIZE     	10*PACKET_SIZE
#define PLAY_BUFFER_SIZE        70*PACKET_SIZE
//*****************************************************************************
//
// UDP Socket Structure
//
//***************************************************************************** 
typedef struct UDPSocket
{
    int iSockDesc; //Socket FD
    struct sockaddr_in Server; //Address to Bind - INADDR_ANY for Local IP
    struct sockaddr_in Client; //Client Address or Multicast Group
    int iServerLength;
    int iClientLength;
}tUDPSocket;
/*int sn =0;
struct belkinips{
	int id;
	char bname[5];
	char ip[15];
};
struct node{
	struct belkinips bel;
	struct node *link;
};
struct node *head=NULL,*tail=NULL;

struct philips{
	int id;
	char pname[7];
	char ip[15];
}*philipsip;
*/
struct philips_status{
	char bid[2];
	char statuses[400];
//	char type[20];
//	char name[20];
//	char state[5];
//	char bright[4];
//	char reachable[5];
}p_bulbs;

struct philips_status *p_bulb; 
 

////////////---------------////////         

char timeslap[100];
char userid[10];//user id from app or ui in gpio command

///////-------------///////
void sstartNTP(void)
{
    //int ret;
    //unsigned long ip;
    time_t ts;
    ts = time(NULL);
    System_printf("Current time: %s\n", ctime(&ts));
    strncpy(timeslap,ctime(&ts),strlen(ctime(&ts)));
}
//---------------------------------///
static void InitializeAppVariables()
{
    g_ulStatus = 0;
    g_ulGatewayIP = 0;
  //  memset(g_ucConnectionSSID,0,sizeof(g_ucConnectionSSID));
  //  memset(g_ucConnectionBSSID,0,sizeof(g_ucConnectionBSSID));
    g_ulDestinationIp = IP_ADDR;
    g_uiPortNum = PORT_NUM;
    g_ulPacketCount = UDP_PACKET_COUNT;
}

/////vinay udp/////////
int r=0;
char enddevicemname[8];
char enddeviceip[15];
void vinayudp(void)
{
      sockaddr_in addr;
     int fd, nbytes,addrlen;
     //ip_mreq mreq;
     SlSockIpMreq mreq;
	//struct_sl_sock_ip_mreq mreq;
     char msgbuf[MSGBUFSIZE];

     unsigned int yes=1;            /*** MODIFICATION TO ORIGINAL */

     /* create what looks like an ordinary UDP socket */
     if ((fd=socket(AF_INET,SOCK_DGRAM,0)) < 0) {
	  //perror("socket");
	  //exit(1);
	 IOT_INFO("....socket creation failed....\n");
     }


/**** MODIFICATION TO ORIGINAL */
    /* allow multiple sockets to use the same PORT number */
   /* if (setsockopt(fd,SOL_SOCKET,SO_REUSEADDR,&yes,sizeof(yes)) < 0) {
       //perror("Reusing ADDR failed");
       //exit(1);
	IOT_INFO(".....setsockopt failed.....\n");
       }*/
/*** END OF MODIFICATION TO ORIGINAL */

     /* set up destination address */
     memset(&addr,0,sizeof(addr));
     addr.sin_family=AF_INET;
     addr.sin_addr.s_addr=htonl(INADDR_ANY); /* N.B.: differs from sender */
     addr.sin_port=htons(HELLO_PORT);
     
     /* bind to receive address */
     if (bind(fd,(struct sockaddr *) &addr,sizeof(addr)) < 0) {
	 // perror("bind");
	 // exit(1);
	IOT_INFO("....bind failed....\n");
     }
     
     /* use setsockopt() to request that the kernel join a multicast group */
     //mreq.imr_multiaddr.s_addr=inet_addr(HELLO_GROUP);
	//mreq.imr_multiaddr.s_addr=htonl(HELLO_GROUP);
       mreq.imr_multiaddr.s_addr=sl_Htonl((unsigned int)IP_ADDR);
     mreq.imr_interface.s_addr=htonl(INADDR_ANY);
     if (setsockopt(fd,IPPROTO_IP,IP_ADD_MEMBERSHIP,&mreq,sizeof(mreq)) < 0) {
	  //perror("setsockopt");
	  //exit(1);
	  IOT_INFO("......setsockopt failed.....\n");
     }
	int udppackets=0,a=0,b=0;
     /* now just enter a read-print loop */
     while (1) {
	  addrlen=sizeof(addr);
	  if ((nbytes=recvfrom(fd,msgbuf,MSGBUFSIZE,0,
			       (struct sockaddr *) &addr,&addrlen)) < 0) {
	       //perror("recvfrom");
	       //exit(1);
		IOT_INFO(".....recvfrom failed.....\n");
	  }
	 // puts(message);
		//IOT_INFO("....%s.....",msgbuf);
		IOT_INFO("....%d.....",(unsigned int)addr.sin_addr.s_addr);
		IOT_INFO("....%x.....",addr.sin_addr.s_addr);
		IOT_INFO("....%x.....",REV_IP(addr.sin_addr.s_addr));
		unsigned int val = REV_IP(addr.sin_addr.s_addr);

			

