purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
		IOT_INFO("%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
		udppackets++;
		IOT_INFO("---udppackets received  %d-----\n",udppackets);
		if(a==0 || b<=10)
		{
			if(a==0)
			{
				if( strstr(msgbuf,"IpBridge"))
				{
					IOT_INFO("philips bridge ip is ---%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
			
					sprintf(philips_uri,"%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
					IOT_INFO("-------%s------\n",philips_uri);
					//*philipsip->id=a++;
					//strcpy(*philipsip->ip,philips_uri);
					//strcpy(*philipsip->pname,"Philips");
					a=1;
					philipsipstatus=1;
					enddevicestatus=1;
				}
			}
			if(b<10)
			{
				if(strstr(msgbuf,"NOTIFY") && strstr(msgbuf,"Belkin") && strstr(msgbuf,"http://schemas.upnp.org/upnp/1/0/")&& !strstr(msgbuf,"IpBridge"))
				{
					int find=0;
					IOT_INFO("belkin ip is ---%d.%d.%d.%d\n",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
					char uri[15],Bel[5]="Bel";
					int i=0;
					sprintf(uri,"%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
					IOT_INFO("uri is : %s",uri);
					/*
					if(head == NULL){
					struct node *n1=(struct node *)malloc(sizeof(struct node));
					n1->bel.id=sn++;
					strcpy(n1->bel.ip,uri);
					strcat(Bel,sn);
					strcpy(n1->bel.bname,Bel);
					n1->link=NULL;
					head=n1;
					tail=n1;
					}else if(head != NULL){
						struct node *temp=head;
						while(temp->link != NULL){
							if(strcmp(temp->bel.ip,uri))
								temp = temp->link;}
						struct node *new=(struct node *)malloc(sizeof(struct node));
						new->Bel.id=sn++;
						strcpy(new->bel.ip,uri);
						strcat(Bel,sn);
						strcpy(new->bel.bname,Bel);
						new->link=NULL;
						tail = new;
					}*/
					for(i=0;i<10;i++)
					{
						if(!strcmp(belkin_uri[i],uri))
						{
							IOT_INFO("belkin_uri[%d]: {%s} is same as uri{%s}",i,belkin_uri[i],uri);
							find=1;
							break;
						}
					}
					if(find == 1){
						continue;
					}
					else{ 
						strcpy(belkin_uri[r++],uri);
						IOT_INFO("belkin_uri[%d] is : %s",i,belkin_uri[i]);
					}


					/*
					for (i=0;i<10;i++)
					{
						if(!strcmp(belkin_uri[i],uri))
						{
							IOT_INFO("belkin_uri[%d]{%s} is same as uri{%s}",i,belkin_uri[i],uri);
							i=10;
						}
				
						else if(belkin_uri[i][0]=="\0")
						{
							sprintf(belkin_uri[i],"%d.%d.%d.%d",(val & 0xFF000000) >> 24,(val & 0x00FF0000) >> 16,(val & 0x0000FF00) >> 8,val & 0x000000FF);
							IOT_INFO("belkin_uri[%d] is : %s",i,belkin_uri[i]);
							b++;
							i=10;
							enddevicestatus=1;
						}
					}
			
			
			
					//IOT_INFO("-------%s------\n",belkin_uri[0]);
					//b=1;
					belkinipstatus=1;
					*/
					enddevicestatus=1;
				}
			}
		}
		else;
     }
}

static int ConnectToHTTPServer(HTTPCli_Handle httpClient)
{
    long lRetVal = -1;
    struct sockaddr_in addr;
  
  
    /* Resolve HOST NAME/IP */
    /*lRetVal = sl_NetAppDnsGetHostByName((signed char *)HOST_NAME,
                                          strlen((const char *)HOST_NAME),
                                          &g_ulDestinationIP,SL_AF_INET);  */

	lRetVal = sl_NetAppDnsGetHostByName((signed char *)HOST_NAME,
                                          strlen((const char *)HOST_NAME),
                                          &g_ulDestinationIP,SL_AF_INET);
    if(lRetVal < 0)
    {
       // ASSERT_ON_ERROR(GET_HOST_IP_FAILED);
    }

    /* Set up the input parameters for HTTP Connection */
    addr.sin_family = AF_INET;
    addr.sin_port = htons(HOST_PORT);
    addr.sin_addr.s_addr = sl_Htonl(g_ulDestinationIP);

    /* Testing HTTPCli open call: handle, address params only */
    HTTPCli_construct(httpClient);
    lRetVal = HTTPCli_connect(httpClient, (struct sockaddr *)&addr, 0, NULL);
    if (lRetVal < 0)
    {
        IOT_INFO("Connection to server failed. error(%d)\n\r", lRetVal);
       // ASSERT_ON_ERROR(SERVER_CONNECTION_FAILED);
    }    
    else
    {
        IOT_INFO("Connection to server created successfully\r\n");
    }

    return 0;
}

static void BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs) || defined(gcc)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}


//*****************************************************************************
//
//! \brief Flush response body.
//!
//! \param[in]  httpClient - Pointer to HTTP Client instance
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
static int FlushHTTPResponse(HTTPCli_Handle httpClient)
{
    const char *ids[2] = {
                            HTTPStd_FIELD_NAME_CONNECTION, /* App will get connection header value. all others will skip by lib */
                            NULL
                         };
    char buf[128];
    int id;
    int len = 1;
    bool moreFlag = 0;
    char ** prevRespFilelds = NULL;


    /* Store previosly store array if any */
    prevRespFilelds = HTTPCli_setResponseFields(httpClient, ids);

    /* Read response headers */
    while ((id = HTTPCli_getResponseField(httpClient, buf, sizeof(buf), &moreFlag))
            != HTTPCli_FIELD_ID_END)
    {

        if(id == 0)
        {
            if(!strncmp(buf, "close", sizeof("close")))
            {
                IOT_INFO("Connection terminated by server\n\r");
            }
        }

    }

    /* Restore previosuly store array if any */
    HTTPCli_setResponseFields(httpClient, (const char **)prevRespFilelds);

    while(1)
    {
        /* Read response data/body */
        /* Note:
                moreFlag will be set to 1 by HTTPCli_readResponseBody() call, if more
                data is available Or in other words content length > length of buffer.
                The remaining data will be read in subsequent call to HTTPCli_readResponseBody().
                Please refer HTTP Client Libary API documenation @ref HTTPCli_readResponseBody
                for more information.
        */
        HTTPCli_readResponseBody(httpClient, buf, sizeof(buf) - 1, &moreFlag);
        //ASSERT_ON_ERROR(len);

        if ((len - 2) >= 0 && buf[len - 2] == '\r' && buf [len - 1] == '\n'){
            break;
        }

        if(!moreFlag)
        {
            /* There no more data. break the loop. */
            break;
        }
    }
    return 0;
}


//*****************************************************************************
//
//! \brief Handler for parsing JSON data
//!
//! \param[in]  ptr - Pointer to http response body data
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
jsmntok_t   *tokenList;
int noOfToken;
char philipsbulbid[2];
char philipsbulbstatus[400];
int philipsgetstatus=0;
int ParseJSONData(char *ptr)
{
    long lRetVal = 0;
    
    jsmn_parser parser;
    


