purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
    /* Initialize JSON PArser */
    jsmn_init(&parser);

    /* Get number of JSON token in stream as we we dont know how many tokens need to pass */
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), NULL, 10);
    if(noOfToken <= 0)
    {
    	IOT_INFO("Failed to initialize JSON parser\n\r");
    	return -1;

    }

    /* Allocate memory to store token */
    tokenList = (jsmntok_t *) malloc(noOfToken*sizeof(jsmntok_t));
    if(tokenList == NULL)
    {
        IOT_INFO("Failed to allocate memory\n\r");
        return -1;
    }

    /* Initialize JSON Parser again */
    jsmn_init(&parser);
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), tokenList, noOfToken);
    if(noOfToken < 0)
    {
    	IOT_INFO("Failed to parse JSON tokens\n\r");
    	lRetVal = noOfToken;
    }
    else
    {
    	IOT_INFO("Successfully parsed %ld JSON tokens\n\r", noOfToken);
	int i=0;
		
	for(i=0;i<noOfToken;i++){	
	//IOT_INFO("----token[%d] = ",i);
	//IOT_INFO("----%s------\n",tokenList[i]);}
	//IOT_INFO("parser------%s-------\n",&parser);
		jsmntok_t key = tokenList[i];
		unsigned int length = key.end - key.start;
		char keyString[length + 1];    
		memcpy(keyString, &((const char *)ptr)[key.start], length);
		keyString[length] = '\0';
		//if(i == noOfToken){
		  //id_len=sizeof(keyString);
		  //strncpy(keyString,philips_id,id_len);
		  IOT_INFO("i=%d\n",i);
		  IOT_INFO("Key: %s\n", keyString);
		  //IOT_INFO("my Key: %s\n", keyString[1]);
		//}
		if(philipsbulbget==1)
		{
			if(i==0)
			{
				id_len=sizeof(keyString);
				strncpy(philipsbulbstatus,keyString,id_len);
				IOT_INFO("philips bulb status: %s---\n", philipsbulbstatus);
				philipssinglebulbget=1;
			}
			philipsbulbget=0;

		}
		if (philips_config==1){
		if(i == noOfToken-1){
			
			IOT_INFO("philips config---\n");
			if((strcmp(keyString,"link button not pressed"))==0)
			{
				philipsidstatus=1;
				enddevicestatus=1;
			}
			else
			{
				id_len=sizeof(keyString);
				strncpy(philips_id,keyString,id_len);
				IOT_INFO("philips id: %s---\n", philips_id);
				philipsidstatus=2;
				enddevicestatus=1;
			}
			philips_config=0;
		}	
		}
		if(philipsget==1)
		{
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*/
			for(i=1;i<noOfToken;i+=42)
			{
				jsmntok_t key = tokenList[i];
				unsigned int length = key.end - key.start;
				//IOT_INFO("length of the string is %d\n",length);
				char keyString[length + 1];
				//keyString[length] = '\0';    
				memcpy(keyString, &((const char *)ptr)[key.start], length);
				keyString[length] = '\0';
		
				IOT_INFO("i=%d\n",i);
				//if(i/21==0){
				//p_bulb = (struct philips_status *)malloc(sizeof(struct philips_status));
				//strcpy(p_bulb->bid,keyString);
				//IOT_INFO("Key: %s\n", p_bulb->bid);
				//strncpy(p_bulbs.bid,keyString,strlen(keyString));
				strncpy(philipsbulbid,keyString,strlen(keyString));
				//IOT_INFO("Key: %s\n", p_bulbs.bid);
				//IOT_INFO("Key: %s\n", p_bulbs.bid);
				
				IOT_INFO("Key: %s\n", philipsbulbid);	
				//}else if(i/22==0){
			 	key = tokenList[i+1];
				length = key.end - key.start;
				//IOT_INFO("length of the string is %d\n",length);
				char keyString1[length + 1];    
				memcpy(keyString1, &((const char *)ptr)[key.start], length);
				keyString1[length] = '\0';
		
				//IOT_INFO("i=%d\n",i+1);
				//strncpy(p_bulb->statuses,keyString,length);
				//IOT_INFO("Key: %s\n", p_bulb->statuses);
				//strncpy(p_bulbs.statuses,keyString,length);
				//IOT_INFO("Key: %s\n", p_bulbs.statuses);
				strncpy(philipsbulbstatus,keyString1,length);
				//IOT_INFO("Key: %s\n", philipsbulbstatus);
				IOT_INFO("Key: %s\n", philipsbulbstatus);
				//}
//				IOT_INFO("Key: %s\n", keyString);
//				IOT_INFO("my Key: %s\n", keyString[1]);
				philipsgetstatus=1;
				Task_sleep(1500);
			}
			philipsget=0;
		}
		
		
	}
    }

    free(tokenList);

    return lRetVal;
}

/////////////get json

int getParseJSONData(char *ptr)
{
    long lRetVal = 0;
    int noOfToken;
    jsmn_parser parser;
    jsmntok_t   *tokenList;


    /* Initialize JSON PArser */
    jsmn_init(&parser);

    /* Get number of JSON token in stream as we we dont know how many tokens need to pass */
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), NULL, 10);
    if(noOfToken <= 0)
    {
    	IOT_INFO("Failed to initialize JSON parser\n\r");
    	return -1;

    }

    /* Allocate memory to store token */
    tokenList = (jsmntok_t *) malloc(noOfToken*sizeof(jsmntok_t));
    if(tokenList == NULL)
    {
        IOT_INFO("Failed to allocate memory\n\r");
        return -1;
    }

    /* Initialize JSON Parser again */
    jsmn_init(&parser);
    noOfToken = jsmn_parse(&parser, (const char *)ptr, strlen((const char *)ptr), tokenList, noOfToken);
    if(noOfToken < 0)
    {
    	IOT_INFO("Failed to parse JSON tokens\n\r");
    	lRetVal = noOfToken;
    }
    else
    {
    	IOT_INFO("Successfully parsed %ld JSON tokens\n\r", noOfToken);
	int i=1;
	
		
	for(i=1;i<noOfToken;i+=42)
	{
		jsmntok_t key = tokenList[i];
		unsigned int length = key.end - key.start;
		char keyString[length + 1];    
		memcpy(keyString, &((const char *)ptr)[key.start], length);
		keyString[length] = '\0';
		
		IOT_INFO("i=%d\n",i);
		//if(i/21==0){
				strncpy(p_bulb->bid,keyString,length+1);
				IOT_INFO("Key: %s\n", p_bulb->bid);
				IOT_INFO("Key: %s\n", keyString);	
		//}else if(i/22==0){
			 key = tokenList[i+1];
		 length = key.end - key.start;
		//char keyString1[length + 1];    
		memcpy(keyString, &((const char *)ptr)[key.start], length);
		keyString[length] = '\0';
		
		IOT_INFO("i=%d\n",i+1);
			strncpy(p_bulb->statuses,keyString,length+1);
			IOT_INFO("Key: %s\n", p_bulb->statuses);
			IOT_INFO("Key: %s\n", keyString);
		//}
//		IOT_INFO("Key: %s\n", keyString);
//		IOT_INFO("my Key: %s\n", keyString[1]);
		
