purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
	}
    }

    free(tokenList);

    return lRetVal;
}



/*!
    \brief This function read respose from server and dump on console

    \param[in]      httpClient - HTTP Client object

    \return         0 on success else -ve

    \note

    \warning
*/
static int readResponse(HTTPCli_Handle httpClient)
{
	long lRetVal = 0;
	int bytesRead = 0;
	int id = 0;
	unsigned long len = 0;
	int json = 0;
	char *dataBuffer=NULL;
	bool moreFlags = 1;
	const char *ids[4] = {
					HTTPStd_FIELD_NAME_CONTENT_LENGTH,
			                HTTPStd_FIELD_NAME_CONNECTION,
			                HTTPStd_FIELD_NAME_CONTENT_TYPE,
			                NULL
	                     };

	/* Read HTTP POST request status code */
	lRetVal = HTTPCli_getResponseStatus(httpClient);
	if(lRetVal > 0)
	{
		switch(lRetVal)
		{
		case 200:
		{
			IOT_INFO("HTTP Status 200\n\r");
			/*
                 Set response header fields to filter response headers. All
                  other than set by this call we be skipped by library.
			 */
			HTTPCli_setResponseFields(httpClient, (const char **)ids);

			/* Read filter response header and take appropriate action. */
			/* Note:
                    1. id will be same as index of fileds in filter array setted
                    in previous HTTPCli_setResponseFields() call.

                    2. moreFlags will be set to 1 by HTTPCli_getResponseField(), if  field
                    value could not be completely read. A subsequent call to
                    HTTPCli_getResponseField() will read remaining field value and will
                    return HTTPCli_FIELD_ID_DUMMY. Please refer HTTP Client Libary API
                    documenation @ref HTTPCli_getResponseField for more information.
			 */
			while((id = HTTPCli_getResponseField(httpClient, (char *)g_buff, sizeof(g_buff), &moreFlags))
					!= HTTPCli_FIELD_ID_END)
			{

				
				IOT_INFO("data in while---%s--%d--\n",(const char *)g_buff,sizeof(g_buff));
				IOT_INFO("Switch Case...%d..\n",id);
				len = strtoul((char *)g_buff, NULL, 0);
				//IOT_INFO("len in case0 -----%d-----\n",len);
				//IOT_INFO();
				len = sizeof(g_buff);
				switch(id)
				{
				case 0: /* HTTPCli_FIELD_NAME_CONTENT_LENGTH */
				{
					len = strtoul((char *)g_buff, NULL, 0);
					IOT_INFO("len in case0 -----%d-----\n",len);
				}
				break;
				case 1: /* HTTPCli_FIELD_NAME_CONNECTION */
				{
				}
				break;
				case 2: /* HTTPCli_FIELD_NAME_CONTENT_TYPE */
				{
					//len = strtoul((char *)g_buff, NULL, 10);
					//IOT_INFO("len in case2 -----%d-----\n",len);
					IOT_INFO("vinay---%s---\n",(const char *)g_buff);
					if(!strncmp((const char *)g_buff, "application/json",
							sizeof("application/json")))
					{
						json = 1;
						IOT_INFO("it is in json format");
					}
					else
					{
						/* Note:
                                Developers are advised to use appropriate
                                content handler. In this example all content
                                type other than json are treated as plain text.
						 */
						json = 0;
					}
					IOT_INFO(HTTPStd_FIELD_NAME_CONTENT_TYPE);
					IOT_INFO(" : ");
					IOT_INFO("application/json\n\r");
				}
				break;
				default:
				{
					IOT_INFO("Wrong filter id\n\r");
					lRetVal = -1;
					goto end;
				}
				}
			}
			bytesRead = 0;
			if(len > sizeof(g_buff))
			{
				dataBuffer = (char *) malloc(len);
				if(dataBuffer)
				{
					IOT_INFO("Failed to allocate memory\n\r");
					lRetVal = -1;
					goto end;
				}
			}
			else
			{
				dataBuffer = (char *)g_buff;
			}

			/* Read response data/body */
			/* Note:
                    moreFlag will be set to 1 by HTTPCli_readResponseBody() call, if more
		            data is available Or in other words content length > length of buffer.
		            The remaining data will be read in subsequent call to HTTPCli_readResponseBody().
		            Please refer HTTP Client Libary API documenation @ref HTTPCli_readResponseBody
		            for more information

			 */
			//bytesRead = HTTPCli_readResponseBody(httpClient, (char *)dataBuffer, len, &moreFlags);
			bytesRead = HTTPCli_readRawResponseBody(httpClient, (char *)dataBuffer, len);
			/*if(bytesRead < 0)
			{
				IOT_INFO("Failed to received response body\n\r");
				lRetVal = bytesRead;
				goto end;
			}
			else if( bytesRead < len || moreFlags)
			{
				IOT_INFO("Mismatch in content length and received data length\n\r");
				goto end;
			}*/
			dataBuffer[bytesRead] = '\0';

			if(json)
			{
				IOT_INFO("----%s-----\n",dataBuffer);
				/* Parse JSON data */
				//char *dummydata = "{\"on\":false}";
				//IOT_INFO("------%s----\n",dummydata);
				//lRetVal = ParseJSONData(dummydata);
				//if(lRetVal < 0)
				//{
				//	goto end;
				//}
				lRetVal = ParseJSONData(dataBuffer);
				//lRetVal = getParseJSONData(dataBuffer);
				if(lRetVal < 0)
				{
					goto end;
				}
			}
			else
			{
				/* treating data as a plain text */
				IOT_INFO("----%s-----\n",dataBuffer);
			}

		}
		break;

		case 404:
			IOT_INFO("File not found. \r\n");
			/* Handle response body as per requirement.
                  Note:
                    Developers are advised to take appopriate action for HTTP
                    return status code else flush the response body.

                    In this example we are flushing response body in default
                    case for all other than 200 HTTP Status code.
			 */
		default:
			/* Note:
              Need to flush received buffer explicitly as library will not do
              for next request.Apllication is responsible for reading all the
              data.
			 */
			FlushHTTPResponse(httpClient);
			break;
		}
	}
	else
	{
		IOT_INFO("Failed to receive data from server.\r\n");
		goto end;
	}

	lRetVal = 0;

end:
    if(len > sizeof(g_buff) && (dataBuffer != NULL))
	{
	    free(dataBuffer);
    }
    return lRetVal;
}

/////-------for philips config--------////////

static int philipsconfig(HTTPCli_Handle httpClient)
{
    bool moreFlags = 1;
    bool lastFlag = 1;
    char tmpBuf[4];
    long lRetVal = 0;
    HTTPCli_Field fields[4] = {
				{HTTPStd_FIELD_NAME_HOST, HOST_NAME},
                                {HTTPStd_FIELD_NAME_ACCEPT, "*/*"},
                                {HTTPStd_FIELD_NAME_CONTENT_TYPE, "text/html"},
                                {NULL, NULL}	
			      };
//{"SOAPACTION", "urn:Belkin:service:basicevent:1#SetBinaryState"},
//{NULL, NULL}	
   // ; charset=utf-8
//{NULL, NULL}
    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send POST method request. */
    /* Here we are setting moreFlags = 1 as there are some more header fields need to send
       other than setted in previous call HTTPCli_setRequestFields() at later stage.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
    */
    moreFlags = 1;
    char *vinayuri;
    vinayuri = "/api";
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPStd_POST, vinayuri, moreFlags);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }

    sprintf((char *)tmpBuf, "%d", (sizeof(CONFIG_DATA)-1));

    /* Here we are setting lastFlag = 1 as it is last header field.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
    */
    lastFlag = 1;
    lRetVal = HTTPCli_sendField(httpClient, HTTPStd_FIELD_NAME_CONTENT_LENGTH, (const char *)tmpBuf, lastFlag);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }


    /* Send POST data/body */
    lRetVal = HTTPCli_sendRequestBody(httpClient, CONFIG_DATA, (sizeof(CONFIG_DATA)-1));
    IOT_INFO(CONFIG_DATA);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request body.\n\r");
        return lRetVal;
    }


    lRetVal = readResponse(httpClient);

