purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
    return lRetVal;
}

/////////////////// 
/////----for philips off-----/////
static int HTTPPutMethod(HTTPCli_Handle httpClient)
{
  
    long lRetVal = 0;
    HTTPCli_Field fields[4] = {
                                {HTTPStd_FIELD_NAME_HOST, HOST_NAME},
                                {HTTPStd_FIELD_NAME_ACCEPT, "*/*"},
                                {HTTPStd_FIELD_NAME_CONTENT_TYPE, "text/html"},
                                {NULL, NULL}
                            };
    bool        moreFlags = 1;
    bool        lastFlag = 1;
    char        tmpBuf[4];
    
    
    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send PUT method request. */
    /* Here we are setting moreFlags = 1 as there are some more header fields need to send
       other than setted in previous call HTTPCli_setRequestFields() at later stage.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
    */
    moreFlags = 1;
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPStd_PUT, philips_request_uri, moreFlags);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP PUT request header.\n\r");
        return lRetVal;
    }
    sprintf((char *)tmpBuf, "%d", (sizeof(PUT_DATA)-1));

    /* Here we are setting lastFlag = 1 as it is last header field.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
    */
    lastFlag = 1;
    lRetVal = HTTPCli_sendField(httpClient, HTTPStd_FIELD_NAME_CONTENT_LENGTH, (char *)tmpBuf, lastFlag);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP PUT request header.\n\r");
        return lRetVal;
    }

    /* Send PUT data/body */
    lRetVal = HTTPCli_sendRequestBody(httpClient, PUT_DATA, (sizeof(PUT_DATA)-1));
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP PUT request body.\n\r");
        return lRetVal;
    }

    lRetVal = readResponse(httpClient);

    return lRetVal;
}

///////      ----------- ///////////


/// -------------FOR PHILIPS ON ----------///////////

static int HTTPPutMethodon(HTTPCli_Handle httpClient)
{
  
    long lRetVal = 0;
    HTTPCli_Field fields[4] = {
                                {HTTPStd_FIELD_NAME_HOST, HOST_NAME},
                                {HTTPStd_FIELD_NAME_ACCEPT, "*/*"},
                                {HTTPStd_FIELD_NAME_CONTENT_TYPE, "text/html"},
                                {NULL, NULL}
                            };
    bool        moreFlags = 1;
    bool        lastFlag = 1;
    char        tmpBuf[4];
    
    
    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send PUT method request. */
    /* Here we are setting moreFlags = 1 as there are some more header fields need to send
       other than setted in previous call HTTPCli_setRequestFields() at later stage.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
    */
    moreFlags = 1;
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPStd_PUT, philips_request_uri, moreFlags);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP PUT request header.\n\r");
        return lRetVal;
    }
    sprintf((char *)tmpBuf, "%d", (sizeof(PUT_DATA1)-1));



    /* Here we are setting lastFlag = 1 as it is last header field.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
    */
    lastFlag = 1;
    lRetVal = HTTPCli_sendField(httpClient, HTTPStd_FIELD_NAME_CONTENT_LENGTH, (char *)tmpBuf, lastFlag);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP PUT request header.\n\r");
        return lRetVal;
    }

    /* Send PUT data/body */
    lRetVal = HTTPCli_sendRequestBody(httpClient, PUT_DATA1, (sizeof(PUT_DATA1)-1));
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP PUT request body.\n\r");
        return lRetVal;

    }

    lRetVal = readResponse(httpClient);

    return lRetVal;
}
//*****************************************************************************
//
//! \brief HTTP POST Demonstration
//!
//! \param[in]  httpClient - Pointer to http client
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
static int HTTPPostMethod(HTTPCli_Handle httpClient)
{
    bool moreFlags = 1;
    bool lastFlag = 1;
    char tmpBuf[4];
    long lRetVal = 0;
    HTTPCli_Field fields[5] = {
                                {HTTPStd_FIELD_NAME_HOST, HOST_NAME},
                                {HTTPStd_FIELD_NAME_ACCEPT, "*/*"},
                                {HTTPStd_FIELD_NAME_CONTENT_TYPE, "text/xml; charset=utf-8"},
				{HTTPStd_FIELD_NAME_SOAPACTION, "\"urn:Belkin:service:basicevent:1#SetBinaryState\""},
				{NULL, NULL}	
			      };
//{"SOAPACTION", "urn:Belkin:service:basicevent:1#SetBinaryState"},
//{NULL, NULL}	
   // ; charset=utf-8
//{NULL, NULL}
    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send POST method request. */
    /* Here we are setting moreFlags = 1 as there are some more header fields need to send
       other than setted in previous call HTTPCli_setRequestFields() at later stage.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
    */
    moreFlags = 1;
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPStd_POST, POST_REQUEST_URI, moreFlags);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }

    sprintf((char *)tmpBuf, "%d", (sizeof(POST_DATA)-1));

    /* Here we are setting lastFlag = 1 as it is last header field.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
    */
    lastFlag = 1;
    lRetVal = HTTPCli_sendField(httpClient, HTTPStd_FIELD_NAME_CONTENT_LENGTH, (const char *)tmpBuf, lastFlag);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }


    /* Send POST data/body */
    lRetVal = HTTPCli_sendRequestBody(httpClient, POST_DATA, (sizeof(POST_DATA)-1));
    IOT_INFO(POST_DATA);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request body.\n\r");
        return lRetVal;
    }


    lRetVal = readResponse(httpClient);

