purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
    return lRetVal;
}

static int HTTPPostMethodon(HTTPCli_Handle httpClient)
{
    bool moreFlags = 1;
    bool lastFlag = 1;
    char tmpBuf[4];
    long lRetVal = 0;
    HTTPCli_Field fields[5] = {
                                {HTTPStd_FIELD_NAME_HOST, HOST_NAME},
                                {HTTPStd_FIELD_NAME_ACCEPT, "*/*"},
                                {HTTPStd_FIELD_NAME_CONTENT_TYPE, "text/xml; charset=utf-8"},
				{HTTPStd_FIELD_NAME_SOAPACTION, "\"urn:Belkin:service:basicevent:1#SetBinaryState\""},
				{NULL, NULL}	
			      };
//{"SOAPACTION", "urn:Belkin:service:basicevent:1#SetBinaryState"},
//{NULL, NULL}	
   // ; charset=utf-8
//{NULL, NULL}
    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send POST method request. */
    /* Here we are setting moreFlags = 1 as there are some more header fields need to send
       other than setted in previous call HTTPCli_setRequestFields() at later stage.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
    */
    moreFlags = 1;
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPStd_POST, POST_REQUEST_URI, moreFlags);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }

    sprintf((char *)tmpBuf, "%d", (sizeof(POST_DATA1)-1));

    /* Here we are setting lastFlag = 1 as it is last header field.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
    */
    lastFlag = 1;
    lRetVal = HTTPCli_sendField(httpClient, HTTPStd_FIELD_NAME_CONTENT_LENGTH, (const char *)tmpBuf, lastFlag);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }


    /* Send POST data/body */
    lRetVal = HTTPCli_sendRequestBody(httpClient, POST_DATA1, (sizeof(POST_DATA1)-1));
    IOT_INFO(POST_DATA);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP POST request body.\n\r");
        return lRetVal;
    }


    lRetVal = readResponse(httpClient);

    return lRetVal;
}


//*****************************************************************************
//
//! \brief HTTP GET Demonstration
//!
//! \param[in]  httpClient - Pointer to http client
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
static int HTTPGetMethod(HTTPCli_Handle httpClient)
{
  
    long lRetVal = 0;
    HTTPCli_Field fields[4] = {
                                //{HTTPStd_FIELD_NAME_HOST, HOST_NAME},
				{HTTPStd_FIELD_NAME_HOST, HOST_NAME},
                                {HTTPStd_FIELD_NAME_ACCEPT, "*/*"},
                                {HTTPStd_FIELD_NAME_CONTENT_LENGTH, "0"},
				 //{HTTPStd_FIELD_NAME_CONTENT_TYPE, "application/json"},
                                {NULL, NULL}
                            };
    bool        moreFlags;
    
    
    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send GET method request. */
    /* Here we are setting moreFlags = 0 as there are no more header fields need to send
       at later stage. Please refer HTTP Library API documentaion @ HTTPCli_sendRequest
       for more information.
    */
    moreFlags = 0;
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPStd_GET, philips_request_uri, moreFlags);
    if(lRetVal < 0)
    {
        IOT_INFO("Failed to send HTTP GET request.\n\r");
        return lRetVal;
    }

    //lRetval = HTTPCli_readRawResponseBody()
    lRetVal = readResponse(httpClient);

    return lRetVal;
}



////////------------//////////

char HostAddress[255] = AWS_IOT_MQTT_HOST;
uint32_t port = AWS_IOT_MQTT_PORT;
uint32_t publishCount = 0;
unsigned int  uiChannel;
float pw=0;
int ch=0;
int status=0;


float power(int ch_no){
if (ch_no == 1)
	uiChannel = ADC_CH_0;
else if (ch_no == 2)
	uiChannel = ADC_CH_1;
else if (ch_no == 3)
	uiChannel = ADC_CH_2;
else if (ch_no == 4)
	uiChannel = ADC_CH_3;

#ifdef CC3200_ES_1_2_1
        //
        // Enable ADC clocks.###IMPORTANT###Need to be removed for PG 1.32
        //
        HWREG(GPRCM_BASE + GPRCM_O_ADC_CLK_CONFIG) = 0x00000043;
        HWREG(ADC_BASE + ADC_O_ADC_CTRL) = 0x00000004;
        HWREG(ADC_BASE + ADC_O_ADC_SPARE0) = 0x00000100;
        HWREG(ADC_BASE + ADC_O_ADC_SPARE1) = 0x0355AA00;
#endif

        //
        // Configure ADC timer which is used to timestamp the ADC data samples
        //
        MAP_ADCTimerConfig(ADC_BASE,2^17);

	//PinTypeADC(PIN_59, 0xFF);

        //
        // Enable ADC timer which is used to timestamp the ADC data samples
        //
        MAP_ADCTimerEnable(ADC_BASE);

        //
        // Enable ADC module
        //
        MAP_ADCEnable(ADC_BASE);

        //
        // Enable ADC channel
        //

        MAP_ADCChannelEnable(ADC_BASE, uiChannel);
	//MAP_UtilsDelay(800000);

	if(MAP_ADCFIFOLvlGet(ADC_BASE, uiChannel)){

	        unsigned long ulSample = MAP_ADCFIFORead(ADC_BASE, uiChannel);
		IOT_INFO("%lu\n",ulSample);
		IOT_INFO("%f...\n",(float)((ulSample >> 2 ) & 0x0FFF));
		IOT_INFO("\n\rVoltage is %f\n\r",(((float)((ulSample >> 2 ) & 0x0FFF))*1.4)/4096);
		pw=(((float)((ulSample >> 2 ) & 0x0FFF))*1.4)/4096;
	}
return pw;
}


char dexterpistring[100];
int size;
void MQTTcallbackHandler(AWS_IoT_Client *pClient, char *topicName,
        uint16_t topicNameLen, IoT_Publish_Message_Params *params, void *pData)
{
	//int status=0;
    IOT_INFO("Subscribe callback");
    IOT_INFO("%.*s\t%.*s",topicNameLen, topicName, (int)params->payloadLen,
            (char *)params->payload);
	strncpy(dexterpistring,(char *)params->payload,(int)params->payloadLen);
	IOT_INFO("dexterpistring in mqtt handler is : %s\n",dexterpistring);
	size = (int)params->payloadLen;
}

    //IOT_INFO("%d",(int)params->payloadLen);
   // IOT_INFO("%s",(char *)params->payload);

    //size = (int)params->payloadLen;
   // IOT_INFO("--------%d------\n",size);
    //const char *string = ((char *)params->payload);

