purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
void dexterpicontroller(void)
{
while(1)
{
if (dexterpistring[0] != "\0")
{
IOT_INFO(". : %s\n",dexterpistring);
//int size = (int)sizeof(dexterpistring);
    char string[size];
    //char string1[size];
    //char *string1;
    //string1 = malloc(size);
    int dummy = 0;
    //memset(string, '\0', sizeof(string));
    strcpy(string,dexterpistring);
    strncat(string, " ", size+1);
    //IOT_INFO("vinay----%s------\n",string);
if(!strncmp(dexterpistring ,"gpio", 4)){
 const char s[2] = " ";
   char *token;
   
   /* get the first token */
   token = strtok(string, s);
   char *word[5];
   int dummy2 = 0;
   
   /* walk through other tokens */
   while( token != NULL ) 
   {
      printf( " %s\n", token );
      word[dummy2] = token;
      dummy2++;
    
      token = strtok(NULL, s);
   }
   IOT_INFO("---%s-----\n",word[4]);
   //for(dummy=0;dummy<=dummy2;dummy++){
	//if(word[dummy] == "from"){
         strcpy(userid,word[4]);//}}
   IOT_INFO("userid---%s-----\n",userid);
}

if(!strncmp(dexterpistring ,"philips", 7)){
 const char s[2] = " ";
   char *token;
   
   /* get the first token */
   token = strtok(string, s);
   char *word[3];
   int dummy2 = 0;
   
   /* walk through other tokens */
   while( token != NULL ) 
   {
      printf( " %s\n", token );
      word[dummy2] = token;
      dummy2++;
    
      token = strtok(NULL, s);
   }
   IOT_INFO("---%s-----\n",word[2]);
   //for(dummy=0;dummy<=dummy2;dummy++){  {\"on\":true,\"sat\":254,"\bri\":254,\"hue\":10000}
	//if(word[dummy] == "from"){
	char philipsmessage[52];
	char id[2];
         strcpy(philipsmessage,word[2]);//}}
	 strcpy(id,word[1]);
	strcpy(bulbnumber,word[1]);
   IOT_INFO("philips bulb id---%s-----\n",id);
   IOT_INFO("philipsmessage---%s-----\n",philipsmessage);

strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
sprintf(philips_request_uri,"/api/%s/lights/%s/state",philips_id,id);
long lRetVal = -1;
sprintf(PUT_DATA,"%s",philipsmessage);
IOT_INFO("put data is %s\n",PUT_DATA);
    HTTPCli_Struct httpClient1;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient1);
    /*if(lRetVal < 0)
    {
        LOOP_FOREVER();
    }
*/
    IOT_INFO("\n\r");

 IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethod(&httpClient1);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r");
    HTTPCli_disconnect(&httpClient1);
/*/////////added for get//////
philipsget=1;
sprintf(philips_request_uri,"/api/%s/lights",philips_id);
lRetVal = ConnectToHTTPServer(&httpClient);

IOT_INFO("HTTP Get Begin:\n\r");
    lRetVal = HTTPGetMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post Get failed.\n\r");
    }
    IOT_INFO("HTTP Get End:\n\r");

//////////*/
//Task_sleep(1000);
philipsbulbget=1;
HTTPCli_Struct httpClient10;
sprintf(philips_request_uri,"/api/%s/lights/%s",philips_id,id);
lRetVal = ConnectToHTTPServer(&httpClient10);

IOT_INFO("HTTP Get Begin:\n\r");
    lRetVal = HTTPGetMethod(&httpClient10);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post Get failed.\n\r");
    }
    IOT_INFO("HTTP Get End:\n\r");
   HTTPCli_disconnect(&httpClient10);

}

if(!strncmp(dexterpistring ,"Belkin", 6)){
 const char s[2] = " ";
   char *token;
	int belkin_number;
   
   /* get the first token */
   token = strtok(string, s);
   char *word[5];
   int dummy2 = 0;
   
   /* walk through other tokens */
   while( token != NULL ) 
   {
      printf( " %s\n", token );
      word[dummy2] = token;
      dummy2++;
    
      token = strtok(NULL, s);
   }
   //IOT_INFO("---%s-----\n",word[4]);
   //for(dummy=0;dummy<=dummy2;dummy++){
	//if(word[dummy] == "from"){
        // strcpy(userid,word[4]);//}}
   //IOT_INFO("userid---%s-----\n",userid);

belkin_number=atoi(word[1]);
IOT_INFO("belkin number=%d\n",belkin_number);
IOT_INFO("Belkin Function Call...\n");
long lRetVal = -1;
strcpy(HOST_NAME,belkin_uri[belkin_number-1]);
HOST_PORT = 49153;
    HTTPCli_Struct httpClient2;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient2);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    if(!strcmp(word[2],"on")){
    strcpy(belkinstatus[belkin_number-1],"1");
    lRetVal = HTTPPostMethodon(&httpClient2);}
    else if(!strcmp(word[2],"off")){
    strcpy(belkinstatus[belkin_number-1],"0");
    lRetVal = HTTPPostMethod(&httpClient2);}
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
    HTTPCli_disconnect(&httpClient2);
    enddevicestatus=1;
}

 if(!strncmp(dexterpistring ,"gpio 1 on", 9)){
	GPIOPinWrite(GPIOA3_BASE, 0x10, 0x10);
	ch = 1;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);

 }

 if(!strncmp(dexterpistring ,"gpio 2 on", 9)){
	GPIOPinWrite(GPIOA1_BASE, 0x80, 0x80);
	ch =2;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
}

 if(!strncmp(dexterpistring ,"gpio 3 on", 9)){
        GPIOPinWrite(GPIOA1_BASE, 0x40, 0x40);
	ch =3;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp(dexterpistring ,"gpio 4 on", 9)){
        GPIOPinWrite(GPIOA1_BASE, 0x10, 0x10);

	ch=4;
	status = 1;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 } 

 if(!strncmp(dexterpistring ,"gpio 1 off", 10)){
	GPIOPinWrite(GPIOA3_BASE, 0x10, 0x0);
ch =1;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp(dexterpistring ,"gpio 2 off", 10)){
	GPIOPinWrite(GPIOA1_BASE, 0x80, 0x0);
ch=2;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp(dexterpistring ,"gpio 3 off ", 10)){
        GPIOPinWrite(GPIOA1_BASE, 0x40, 0x0);
ch=3;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 }

 if(!strncmp(dexterpistring ,"gpio 4 off", 10)){
        GPIOPinWrite(GPIOA1_BASE, 0x10, 0x0);
 ch=4;
	status = 0;
	sstartNTP();
	IOT_INFO("----current time = %s-----",timeslap);
 } 
 if(!strncmp(dexterpistring ,"discover", 8)){
	IOT_INFO("----Discover-----");
	//sri_recev();	
	//discover();
	//vinayudp();
	enddevicestatus=1;

	        
