purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
 }
 if(!strncmp(dexterpistring ,"multicast", 9)){
	IOT_INFO("----SENDMULTICAST-----");
	//SendMulticast();
 }
/* if(!strncmp((char *)params->payload ,"multi", 5)){
	IOT_INFO("----SENDRevice-----");
recievepack();
}*/
 if(!strncmp(dexterpistring ,"demouser", 8)){
	IOT_INFO("----SENDRevice-----");
//recievepack();
}

//////////added for local host get////////
 if(!strncmp(dexterpistring ,"get local", 9)){
//philipsget=1;
//enddevicestatus=1;
IOT_INFO("local get Function Call...\n");
//getip();
char localuri[15] = "192.168.3.108";
strcpy(HOST_NAME,localuri);
HOST_PORT = 8080;
IOT_INFO("philips get uri before :  %s\n",philips_request_uri);
sprintf(philips_request_uri,"/theja/");
IOT_INFO("philips get uri after :  %s\n",philips_request_uri);
long lRetVal = -1;
    HTTPCli_Struct httpClient22;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient22);
    /*if(lRetVal < 0)
    {
        LOOP_FOREVER();
    }
*/
    IOT_INFO("\n\r");

/* IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r");
*/
IOT_INFO("HTTP Get Begin:\n\r");
    lRetVal = HTTPGetMethod(&httpClient22);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post Get failed.\n\r");
    }
    IOT_INFO("HTTP Get End:\n\r");
    HTTPCli_disconnect(&httpClient22);

}

//////////////

 if(!strncmp(dexterpistring ,"get philips", 11)){
philipsget=1;
//enddevicestatus=1;
IOT_INFO("philips Function Call...\n");
//getip();
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
IOT_INFO("philips get uri before :  %s\n",philips_request_uri);
sprintf(philips_request_uri,"/api/%s/lights",philips_id);
IOT_INFO("philips get uri after :  %s\n",philips_request_uri);
long lRetVal = -1;
    HTTPCli_Struct httpClient3;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient3);
    /*if(lRetVal < 0)
    {
        LOOP_FOREVER();
    }
*/
    IOT_INFO("\n\r");

/* IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethod(&httpClient);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r");
*/
IOT_INFO("HTTP Get Begin:\n\r");
    lRetVal = HTTPGetMethod(&httpClient3);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post Get failed.\n\r");
    }
    IOT_INFO("HTTP Get End:\n\r");
    HTTPCli_disconnect(&httpClient3);

}

    if(!strncmp(dexterpistring ,"philps off", 10)){
IOT_INFO("philips Function Call...\n");
//getip();
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
sprintf(philips_request_uri,"/api/%s/lights/1/state",philips_id);
long lRetVal = -1;
    HTTPCli_Struct httpClient4;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient4);
    /*if(lRetVal < 0)
    {
        LOOP_FOREVER();
    }
*/
    IOT_INFO("\n\r");

 IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethod(&httpClient4);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r");


}

    if(!strncmp(dexterpistring ,"philps on", 9)){
IOT_INFO("philips Function Call...\n");
//getip();
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
sprintf(philips_request_uri,"/api/%s/lights/1/state",philips_id);
long lRetVal = -1;
    HTTPCli_Struct httpClient5;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient5);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");

 IOT_INFO("HTTP Put Begin:\n\r");

    lRetVal = HTTPPutMethodon(&httpClient5);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Put failed.\n\r");
    }
    IOT_INFO("HTTP Put End:\n\r"); 
}

    if(!strncmp(dexterpistring ,"config philips", 14)){
IOT_INFO("philips config Call...\n");
//enddevicestatus=1;
philips_config=1;
long lRetVal = -1;
strcpy(HOST_NAME,philips_uri);
HOST_PORT = 80;
sprintf(philips_request_uri,"/api");
    HTTPCli_Struct httpClient6;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient6);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    lRetVal = philipsconfig(&httpClient6);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
    HTTPCli_disconnect(&httpClient6);
philipsconfigstatus=1;
if (philipsidstatus==2)
{
Task_sleep(500);
philipsget=1;
HTTPCli_Struct httpClient7;
sprintf(philips_request_uri,"/api/%s/lights",philips_id);
lRetVal = ConnectToHTTPServer(&httpClient7);

IOT_INFO("HTTP Get Begin:\n\r");
    lRetVal = HTTPGetMethod(&httpClient7);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post Get failed.\n\r");
    }
    IOT_INFO("HTTP Get End:\n\r");
   HTTPCli_disconnect(&httpClient7);
}

}

    if(!strncmp(dexterpistring ,"belkin on", 9)){
IOT_INFO("Belkin Function Call...\n");
long lRetVal = -1;
strcpy(HOST_NAME,belkin_uri[0]);
HOST_PORT = 49153;
    HTTPCli_Struct httpClient8;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient8);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    lRetVal = HTTPPostMethodon(&httpClient8);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
}

if(!strncmp(dexterpistring ,"belkin off", 10)){
IOT_INFO("Belkin Function Call...\n");
long lRetVal = -1;
strcpy(HOST_NAME,belkin_uri[0]);
HOST_PORT = 49153;
    HTTPCli_Struct httpClient9;


    //
    // Board Initialization
    //
    //BoardInit();
 lRetVal = ConnectToHTTPServer(&httpClient9);
    /*if(lRetVal < 0)
    {

        LOOP_FOREVER();

    }

*/
    IOT_INFO("\n\r");
     IOT_INFO("HTTP Post Begin:\n\r");
    lRetVal = HTTPPostMethod(&httpClient9);
    if(lRetVal < 0)
    {
    	IOT_INFO("HTTP Post failed.\n\r");
    }
    IOT_INFO("HTTP Post End:\n\r");
}

