purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
if (!strncmp(dexterpistring , "gpio all on", 11)){
    IOT_INFO("\n GPIO OFF using COPY..  \n");
    GPIOPinWrite(GPIOA3_BASE, 0x10, 0x10);
    GPIOPinWrite(GPIOA1_BASE, 0x80, 0x80);
    GPIOPinWrite(GPIOA1_BASE, 0x40, 0x40);
    GPIOPinWrite(GPIOA1_BASE, 0x10, 0x10);
}
if (!strncmp(dexterpistring , "gpio all off", 12)){
    IOT_INFO("\n GPIO OFF using COPY..  \n");
    GPIOPinWrite(GPIOA3_BASE, 0x10, 0);
    GPIOPinWrite(GPIOA1_BASE, 0x80, 0);
    GPIOPinWrite(GPIOA1_BASE, 0x40, 0);
    GPIOPinWrite(GPIOA1_BASE, 0x10, 0);
}
for(int i=0;dexterpistring[i]!='\0';i++)
        strcpy(&dexterpistring[i],"\0") ;
}
Task_sleep(1000);
}
}
void disconnectCallbackHandler(AWS_IoT_Client *pClient, void *data)
{
    IOT_WARN("MQTT Disconnect..");
    IoT_Error_t rc = SUCCESS;

    if (NULL == data) {
        return;
    }

    AWS_IoT_Client *client = (AWS_IoT_Client *)data;
    if (aws_iot_is_autoreconnect_enabled(client)) {
        IOT_INFO("Auto Reconnect is enabled, Reconnecting attempt will start now");
    }
    else {
        IOT_WARN("Auto Reconnect not enabled. Starting manual reconnect...");
        rc = aws_iot_mqtt_attempt_reconnect(client);
        if (NETWORK_RECONNECTED == rc) {
            IOT_WARN("Manual Reconnect Successful");
            IOT_WARN("Manual Reconnect Failed - %d", rc);
        }
        else {
            IOT_WARN("Manual Reconnect Failed - %d", rc);
        }
    }
}

void runAWSClient(void)
{
IOT_INFO("\n....RUNNING....AWS_IOT...\n");
    IoT_Error_t rc = SUCCESS;
    int32_t i = 0;
    bool infinitePublishFlag = true;
    char *topicName = "sdkTest/sub";
    int topicNameLen = strlen(topicName);
    char *pubtopicName = "sdkTest/pub";
    int pubtopicNameLen = strlen(pubtopicName);

    AWS_IoT_Client client;
    IoT_Client_Init_Params mqttInitParams = iotClientInitParamsDefault;
    IoT_Client_Connect_Params connectParams = iotClientConnectParamsDefault;

    IoT_Publish_Message_Params paramsQOS0;
    IoT_Publish_Message_Params paramsQOS1;

    IOT_INFO("\nAWS IoT SDK Version %d.%d.%d-%s\n", VERSION_MAJOR, VERSION_MINOR,
            VERSION_PATCH, VERSION_TAG);


    mqttInitParams.enableAutoReconnect = false; // We enable this later below
    mqttInitParams.pHostURL = HostAddress;
    mqttInitParams.port = port;
    /*
     *  The following cert file variables are not used in this release. All
     *  cert files must exist in the "/certs" directory and be named "ca.der",
     *  "cert.der" and "key.der", as shown in the certflasher application. The
     *  ability to change this will be added in a future release.
     */
    mqttInitParams.pRootCALocation = AWS_IOT_ROOT_CA_FILENAME;
    mqttInitParams.pDeviceCertLocation = AWS_IOT_CERTIFICATE_FILENAME;
    mqttInitParams.pDevicePrivateKeyLocation = AWS_IOT_PRIVATE_KEY_FILENAME;
    mqttInitParams.mqttCommandTimeout_ms = 20000;
    mqttInitParams.tlsHandshakeTimeout_ms = 5000;
    mqttInitParams.isSSLHostnameVerify = true;
    mqttInitParams.disconnectHandler = disconnectCallbackHandler;
    mqttInitParams.disconnectHandlerData = (void *)&client;

    rc = aws_iot_mqtt_init(&client, &mqttInitParams);
    if (SUCCESS != rc) {
        IOT_ERROR("aws_iot_mqtt_init returned error : %d ", rc);
    }

    connectParams.keepAliveIntervalInSec = 10;
    connectParams.isCleanSession = true;
    connectParams.MQTTVersion = MQTT_3_1_1;
    connectParams.pClientID = AWS_IOT_MQTT_CLIENT_ID;
    connectParams.clientIDLen = (uint16_t)strlen(AWS_IOT_MQTT_CLIENT_ID);
    connectParams.isWillMsgPresent = false;

    IOT_INFO("Connecting...");
    rc = aws_iot_mqtt_connect(&client, &connectParams);
    if (SUCCESS != rc) {
        IOT_ERROR("Error(%d) connecting to %s:%d", rc, mqttInitParams.pHostURL,
                mqttInitParams.port);
    }

    /*
     *  Enable Auto Reconnect functionality. Minimum and Maximum time of
     *  exponential backoff are set in aws_iot_config.h:
     *  #AWS_IOT_MQTT_MIN_RECONNECT_WAIT_INTERVAL
     *  #AWS_IOT_MQTT_MAX_RECONNECT_WAIT_INTERVAL
     */
    rc = aws_iot_mqtt_autoreconnect_set_status(&client, true);
    if (SUCCESS != rc) {
        IOT_ERROR("Unable to set Auto Reconnect to true - %d", rc);
    }

    IOT_INFO("Subscribing...");
    rc = aws_iot_mqtt_subscribe(&client, topicName, topicNameLen, QOS0,
            MQTTcallbackHandler, NULL);
    if (SUCCESS != rc) {
        IOT_ERROR("Error subscribing (%d)", rc);
    }

    char cPayload[512];
    sprintf(cPayload, "%s : %d ", "hello from SDK", i);

    paramsQOS0.qos = QOS0;
    paramsQOS0.payload = (void *)cPayload;
    paramsQOS0.isRetained = 0;

    paramsQOS1.qos = QOS1;
    paramsQOS1.payload = (void *)cPayload;
    paramsQOS1.isRetained = 0;

    if (publishCount != 0) {
       infinitePublishFlag = false;
    }

    while ((NETWORK_ATTEMPTING_RECONNECT == rc || NETWORK_RECONNECTED == rc ||
            SUCCESS == rc) && (publishCount > 0 || infinitePublishFlag)) {
        rc = aws_iot_mqtt_yield(&client, 150);

        if (NETWORK_ATTEMPTING_RECONNECT == rc) {
            /* If the client is attempting to reconnect, skip rest of loop */
            continue;
        }
	
        IOT_INFO("-->sleep");
        Task_sleep(1000);
       /* sprintf(cPayload, "%s : %d ", "hello from SDK QOS0", i++);
        // Recalculate string len to avoid truncation in subscribe callback 
        paramsQOS0.payloadLen = strlen(cPayload);
        rc = aws_iot_mqtt_publish(&client, pubtopicName, pubtopicNameLen,
                &paramsQOS0);*/
        if (publishCount > 0) {
           publishCount--;
        }
	
	if(ch!=0){
        //sprintf(cPayload, "%s : %f ", "Power = ", power(ch));
	//sprintf(cPayload, "Power of socket %d = %f -----at time %s",ch , power(ch),timeslap);
	sprintf(cPayload, "{ \n \"socketId\" : \"%d\",\n\"status\" : \"%d\",\n\"power\" : \"%f\",\n\"dexterpi_id\" : \"%s\",\n\"userId\" : \"%s\"\n}",ch,status,power(ch),deviceID,userid);
	
        /* Recalculate string len to avoid truncation in subscribe callback */
        paramsQOS1.payloadLen = strlen(cPayload);
        do {
            rc = aws_iot_mqtt_publish(&client, pubtopicName, pubtopicNameLen,
                    &paramsQOS1);
            if (publishCount > 0) {
                publishCount--;
            }
        } while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                (publishCount > 0 || infinitePublishFlag));
   
        ch =0;
	}
	if(devicestate==1)
	{
		///////added for sending to app////////
			IOT_INFO("dexter pi is connected to cloud\n");
			char *pubtopicNames = "sdkTest/sub";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*/

			sprintf(cPayload, "dexterpi is online");
	
        		/* Recalculate string len to avoid truncation in subscribe callback */
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));
		devicestate=0;
	}

