purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
	if(enddevicestatus==1)
	{
		IOT_INFO("discover is called\n");
		char *pubtopicNames = "enddeviceipdetails";//"enddevices/status";
    		int pubtopicNamesLen = strlen(pubtopicNames);
		
		if(philipsidstatus==0)
		{
			/*sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%s\",\n\"PhilipsIDStatus\" : \"no\",\n\"Belkin1IPStatus\" : \"%s\",\n\"Belkin2IPStatus\" : \"%s\",\n\"Belkin3IPStatus\" : \"%s\",\n\"Belkin4IPStatus\" : \"%s\",\n\"Belkin5IPStatus\" : \"%s\",\n\"Belkin6IPStatus\" : \"%s\",\n\"Belkin7IPStatus\" : \"%s\",\n\"Belkin8IPStatus\" : \"%s\",\n\"Belkin9IPStatus\" : \"%s\",\n\"Belkin10IPStatus\" : \"%s\",\n\"dexterpi_id\" : \"%s\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9],deviceID);*/
			sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%s\",\n\"PhilipsIDStatus\" : \"no\",\n\"B1IP\" : \"%s\",\n\"B2IP\" : \"%s\",\n\"B3IP\" : \"%s\",\n\"B4IP\" : \"%s\",\n\"B5IP\" : \"%s\",\n\"B6IP\" : \"%s\",\n\"B7IP\" : \"%s\",\n\"B8IP\" : \"%s\",\n\"B9IP\" : \"%s\",\n\"B10IP\" : \"%s\",\n\"B1S\" : \"%s\",\n\"B2S\" : \"%s\",\n\"B3S\" : \"%s\",\n\"B4S\" : \"%s\",\n\"B5S\" : \"%s\",\n\"B6S\" : \"%s\",\n\"B7S\" : \"%s\",\n\"B8S\" : \"%s\",\n\"B9S\" : \"%s\",\n\"B10S\" : \"%s\",\n\"dexterpi_id\" : \"%s\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9],belkinstatus[0],belkinstatus[1],belkinstatus[2],belkinstatus[3],belkinstatus[4],belkinstatus[5],belkinstatus[6],belkinstatus[7],belkinstatus[8],belkinstatus[9],deviceID);			
		}
		else if(philipsidstatus==1)
		{
			/*///////added for sending to app////////
			IOT_INFO("philips config  is called\n");
			char *pubtopicNames = "sdkTest/sub";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*//*

			sprintf(cPayload, "please press link button on hue bridge");
	
        		/* Recalculate string len to avoid truncation in subscribe callback *//*
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));*/
   
			//////////////

			sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%s\",\n\"PhilipsIDStatus\" : \"no\",\n\"B1IP\" : \"%s\",\n\"B2IP\" : \"%s\",\n\"B3IP\" : \"%s\",\n\"B4IP\" : \"%s\",\n\"B5IP\" : \"%s\",\n\"B6IP\" : \"%s\",\n\"B7IP\" : \"%s\",\n\"B8IP\" : \"%s\",\n\"B9IP\" : \"%s\",\n\"B10IP\" : \"%s\",\n\"B1S\" : \"%s\",\n\"B2S\" : \"%s\",\n\"B3S\" : \"%s\",\n\"B4S\" : \"%s\",\n\"B5S\" : \"%s\",\n\"B6S\" : \"%s\",\n\"B7S\" : \"%s\",\n\"B8S\" : \"%s\",\n\"B9S\" : \"%s\",\n\"B10S\" : \"%s\",\n\"dexterpi_id\" : \"%s\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9],belkinstatus[0],belkinstatus[1],belkinstatus[2],belkinstatus[3],belkinstatus[4],belkinstatus[5],belkinstatus[6],belkinstatus[7],belkinstatus[8],belkinstatus[9],deviceID);				
//sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%d\",\n\"BelkinIPStatus\" : \"%d\",\n\"PhilipsUserIDStatus\" : \"please press link button on hue bridge\",\n\"dexterpi_id\" : \"DEXT01\"\n}",philipsipstatus,belkinipstatus);
		}
		else if(philipsidstatus==2)
		{
			/*///////////added for app////////////
			IOT_INFO("philips config  is called\n");
			char *pubtopicNames = "sdkTest/sub";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*//*

			sprintf(cPayload, "pl 1");
	
        		/* Recalculate string len to avoid truncation in subscribe callback *//*
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));*/
			///////////////

			/*sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%s\",\n\"PhilipsIDStatus\" : \"yes\",\n\"Belkin1IPStatus\" : \"%s\",\n\"Belkin2IPStatus\" : \"%s\",\n\"Belkin3IPStatus\" : \"%s\",\n\"Belkin4IPStatus\" : \"%s\",\n\"Belkin5IPStatus\" : \"%s\",\n\"Belkin6IPStatus\" : \"%s\",\n\"Belkin7IPStatus\" : \"%s\",\n\"Belkin8IPStatus\" : \"%s\",\n\"Belkin9IPStatus\" : \"%s\",\n\"Belkin10IPStatus\" : \"%s\",\n\"dexterpi_id\" : \"%s\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9],deviceID);*/
			sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%s\",\n\"PhilipsIDStatus\" : \"yes\",\n\"B1IP\" : \"%s\",\n\"B2IP\" : \"%s\",\n\"B3IP\" : \"%s\",\n\"B4IP\" : \"%s\",\n\"B5IP\" : \"%s\",\n\"B6IP\" : \"%s\",\n\"B7IP\" : \"%s\",\n\"B8IP\" : \"%s\",\n\"B9IP\" : \"%s\",\n\"B10IP\" : \"%s\",\n\"B1S\" : \"%s\",\n\"B2S\" : \"%s\",\n\"B3S\" : \"%s\",\n\"B4S\" : \"%s\",\n\"B5S\" : \"%s\",\n\"B6S\" : \"%s\",\n\"B7S\" : \"%s\",\n\"B8S\" : \"%s\",\n\"B9S\" : \"%s\",\n\"B10S\" : \"%s\",\n\"dexterpi_id\" : \"%s\"\n}",philips_uri,belkin_uri[0],belkin_uri[1],belkin_uri[2],belkin_uri[3],belkin_uri[4],belkin_uri[5],belkin_uri[6],belkin_uri[7],belkin_uri[8],belkin_uri[9],belkinstatus[0],belkinstatus[1],belkinstatus[2],belkinstatus[3],belkinstatus[4],belkinstatus[5],belkinstatus[6],belkinstatus[7],belkinstatus[8],belkinstatus[9],deviceID);		
			//sprintf(cPayload, "{ \n \"PhilipsIPStatus\" : \"%d\",\n\"BelkinIPStatus\" : \"%d\",\n\"PhilipsUserIDStatus\" : \"have an new userid\",\n\"dexterpi_id\" : \"DEXT01\"\n}",philipsipstatus,belkinipstatus);
		}
		/*
		else if(philipsget==1)
		{
			sprintf(cPayload,"%s",philipsgetdata);
			philipsget=0;
		}*/
		else
		{
			sprintf(cPayload,"discover");
		}
		IOT_INFO("cpayload---%s----",cPayload);
        	/* Recalculate string len to avoid truncation in subscribe callback */
        	paramsQOS1.payloadLen = strlen(cPayload);
        	do {
			
            		rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    	&paramsQOS1);
			IOT_INFO("discover is called to publish\n");
            		if (publishCount > 0) {
                		publishCount--;
            		}
        	} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                (publishCount > 0 || infinitePublishFlag));
		enddevicestatus=0;
	}
    if(philipsconfigstatus==1)
	{
		if(philipsidstatus==1)
		{
			///////added for sending to app////////
			IOT_INFO("philips config  is called\n");
			char *pubtopicNames = "sdkTest/sub";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*/

			sprintf(cPayload, "please press link button on hue bridge");
	
        		/* Recalculate string len to avoid truncation in subscribe callback */
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));
		}
		else if(philipsidstatus==2)
		{
			///////////added for app////////////
			IOT_INFO("philips config  is called\n");
			char *pubtopicNames = "sdkTest/sub";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*/

			sprintf(cPayload, "pl 1");
	
        		/* Recalculate string len to avoid truncation in subscribe callback */
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));
		}
		
   		philipsconfigstatus=0;
	}
	/*if(philipsidstatus==1)
        {
		IOT_INFO("philips config  is called\n");
			char *pubtopicNames = "sdkTest/sub";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*//*

			sprintf(cPayload, "please press link button on hue bridge");
	
        		/* Recalculate string len to avoid truncation in subscribe callback *//*
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));
   
        		philipsidstatus =3;
		}

