purnankareddy/CC3200MOD-SDK/samples/subscribe_publish_sample.c
	if(philipsidstatus==2)
        {
		IOT_INFO("philips config  is called\n");
			char *pubtopicNames = "sdkTest/sub";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*//*

			sprintf(cPayload, "pl 1");
	
        		/* Recalculate string len to avoid truncation in subscribe callback *//*
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));
   
        		philipsidstatus =3;
		}*/	



        //}
/////////added for philips get///////
//philipssinglebulbget
		if(philipssinglebulbget==1)
		{
			IOT_INFO("philips single bulb get  is called\n");
			char *pubtopicNames = "philipsbulbsdetails";
			int pubtopicNamesLen = strlen(pubtopicNames);

			sprintf(cPayload, "{ \n \"philipsbulbId\" : \"%s\",\n\"philipsbulbStatus\" : %s,\n\"dexterpi_id\" : \"%s\",\n\"philipsip\" : \"%s\"\n}",bulbnumber,philipsbulbstatus,deviceID,philips_uri);
	
        		/* Recalculate string len to avoid truncation in subscribe callback */
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));
   
        		philipssinglebulbget =0;
		}	

		if(philipsgetstatus==1)
		{
			IOT_INFO("philips get  is called\n");
			char *pubtopicNames = "philipsbulbsdetails";//"enddevices/status";
    			int pubtopicNamesLen = strlen(pubtopicNames);
			/*if(i/22==0){
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);			
			}*//*
			if(i==0)
			{
				id_len=sizeof(keyString);
				IOT_INFO("philips get data length: %d\n",id_len);
				strncpy(philipsgetdata,keyString,id_len);
				IOT_INFO("philips get data : %s---\n", philipsgetdata);	
			}*/

			sprintf(cPayload, "{ \n \"philipsbulbId\" : \"%s\",\n\"philipsbulbStatus\" : %s,\n\"dexterpi_id\" : \"%s\",\n\"philipsip\" : \"%s\"\n}",philipsbulbid,philipsbulbstatus,deviceID,philips_uri);
	
        		/* Recalculate string len to avoid truncation in subscribe callback */
        		paramsQOS1.payloadLen = strlen(cPayload);
        		do {
            			rc = aws_iot_mqtt_publish(&client, pubtopicNames, pubtopicNamesLen,
                    		&paramsQOS1);
            			if (publishCount > 0) {
                			publishCount--;
            			}
        		} while (MQTT_REQUEST_TIMEOUT_ERROR == rc &&
                		(publishCount > 0 || infinitePublishFlag));
   
        		philipsgetstatus =0;
		}	
////////////////////////////

	else{
        sprintf(cPayload, "%s : %d ", "hello from SDK QOS1", i++);
	}
 }

    if (SUCCESS != rc) {
        IOT_ERROR("An error occurred in the loop. Error code = %d\n", rc);
	runAWSClient();
    }
    else {
        IOT_INFO("Publish done\n");
    }
}
